app/controllers/push_controller.rb

  def push_to_device
    begin
      #fcm = FCM.new("AAAAbe1dEHY:APA91bE4Kqr7l0BEoRANj9nRLB5_oH8izl5oR_nRZE1tFulE7VjRurtFqaHne7JcvGJI8RzNaTDp0UQpQCloVfN0CJN_HRx_byQRxO1hz9r4JyzrLJseAY_nGyC4ssn1IOqupVX3AfqI")
      fcm = FCM.new("AAAAtSbtkSc:APA91bHr7lu2SUB9FpxcLHmjd9zlJkWWWDBjs9pnI_6RXGy_nhekKHGKjj0avSQuLr8lUrGG4tCkrLgi9q-n7qma-zRed7WRyUeA74DG6CHCXlSsClJl8jnGjMoJItj5Tht2d-xBmdoe")
      #registration_ids = ["e1tqz0AuzwI:APA91bE1tGnOUQIBZux20BJzbRw4PRX3LHmT14cIDuCGyVKEk2BrZ51HgfTMqrgx38GNsIZB7AIdSkzPsjwOyMqSqcOCt0Z3-qHwH9iQizvC7USqXg43b5M1gTzvP2Bb_ueo4dR8sI2k"]
      #registration_ids = ["cGy4rVKmBEY:APA91bHJDsVQryGYFILnMjRftgxxmUel1yfchwbj1ABQDFICyGPYt2TOny_UFj0BOLmMHL3p43EQtDOK_1GwShfdkJ837u10sZQq2os8LvUXTIhmVic4oOkHAXokeVrt_eCWovvau9"]
      registration_ids = [User.find_by_rasp_uuid(params['did']).device_uuid]
---
SELECT  `users`.* FROM `users` WHERE `users`.`rasp_uuid` = 'test123' LIMIT 1

  def change_ip
    user = User.find_by_email(params['email'])
    user_rasp = Rasp.find_by_rasp_id(user.rasp_uuid)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = '1212@g.com' LIMIT 1
SELECT  `rasps`.* FROM `rasps` WHERE `rasps`.`rasp_id` = 'asdf' LIMIT 1

  def check_rasp
    begin
      # key value  did/ ip
      did = params['did']
      dip = params['ip']

      rasp = Rasp.find_by_rasp_id(did)
      p rasp
      if rasp.nil?
        rasp = Rasp.new
        rasp.rasp_id = did
        rasp.rasp_ip = dip
      else
        rasp.rasp_ip = dip
      end

      rasp.save
---
SELECT  `rasps`.* FROM `rasps` WHERE `rasps`.`rasp_id` = 'test1123' LIMIT 1
INSERT INTO `rasps` (`rasp_id`, `rasp_ip`, `created_at`, `updated_at`) VALUES ('test1123', 'a112312', '2017-12-13 11:45:06', '2017-12-13 11:45:06')
UPDATE `rasps` SET `rasp_ip` = 'a1111111', `updated_at` = '2017-12-13 11:45:14' WHERE `rasps`.`id` = 4