app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `device_uuid`, `created_at`, `updated_at`, `authentication_token`) VALUES ('khj3753@gmail.com', '$2a$11$sLhVftdQMR5lu8pYPFTkluXoLxOZenVrCVDVwFXC6S1A4nwNWfWYi', '123456789', '2017-12-09 13:43:54', '2017-12-09 13:43:54', 'VxR39m_n2LQwXF2WnBzd')
---
  def create
    email = params['email']
    encrypted_password = params['encrypted_password']
    encrypted_password_confirm = params['encrypted_password_confirm']
    device_uuid = params['device_uuid']
    rasp_uuid = params['rasp_uuid']

    new_user = User.new
    new_user.email = email
    new_user.password = encrypted_password
    new_user.password_confirmation = encrypted_password_confirm
    new_user.device_uuid = device_uuid
    new_user.rasp_uuid = rasp_uuid
    begin
      User.transaction do
        new_user.save!